# OnLineSegment Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IExportContextBase..::..OnLineSegment Method
IExportContextBase Interface See Also
---
This method is called after unhandled curve was tessellated to line segments and sent to the output.
Note for 2D export: if the export is performed for the view in non-Wireframe display style, then
  * this method is called outside of view, instance and link begin/end calls but still between OnElementBegin2D/OnElementEnd2D calls
  * this method is never called for annotation elements, i.e. their geometry should be processed in methods OnCurve and OnPolyline

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
void OnLineSegment(
	LineSegment segment
)
```

Visual Basic
---
```text
Sub OnLineSegment ( _
	segment As LineSegment _
)
```

Visual C++
---
```text
void OnLineSegment(
	LineSegment^ segment
)
```

# ### Parameters
segment
    Type: Autodesk.Revit.DB..::..LineSegment A structure describing the line segment.
# See Also
IExportContextBase Interface
Autodesk.Revit.DB Namespace